ir_version: 6
producer_name: "pytorch"
producer_version: "1.8"
model_version: 0
graph {
  name: "torch-jit-export"
  node {
    input: "image"
    input: "1967"
    input: "1968"
    output: "1966"
    name: "Conv_0"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1966"
    output: "801"
    name: "Relu_1"
    op_type: "Relu"
  }
  node {
    input: "801"
    input: "1970"
    input: "1971"
    output: "1969"
    name: "Conv_2"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1969"
    output: "804"
    name: "Relu_3"
    op_type: "Relu"
  }
  node {
    input: "804"
    output: "805"
    name: "MaxPool_4"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "805"
    input: "1973"
    input: "1974"
    output: "1972"
    name: "Conv_5"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1972"
    output: "808"
    name: "Relu_6"
    op_type: "Relu"
  }
  node {
    input: "808"
    output: "809"
    name: "MaxPool_7"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "809"
    input: "1976"
    input: "1977"
    output: "1975"
    name: "Conv_8"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1975"
    output: "812"
    name: "Relu_9"
    op_type: "Relu"
  }
  node {
    input: "812"
    output: "813"
    name: "MaxPool_10"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "813"
    input: "1979"
    input: "1980"
    output: "1978"
    name: "Conv_11"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1978"
    output: "816"
    name: "Relu_12"
    op_type: "Relu"
  }
  node {
    input: "816"
    output: "817"
    name: "MaxPool_13"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "817"
    input: "1982"
    input: "1983"
    output: "1981"
    name: "Conv_14"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1981"
    output: "820"
    name: "Relu_15"
    op_type: "Relu"
  }
  node {
    input: "820"
    output: "821"
    name: "MaxPool_16"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "821"
    input: "1985"
    input: "1986"
    output: "1984"
    name: "Conv_17"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1984"
    output: "824"
    name: "Relu_18"
    op_type: "Relu"
  }
  node {
    input: "824"
    input: "1988"
    input: "1989"
    output: "1987"
    name: "Conv_19"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1987"
    output: "827"
    name: "Relu_20"
    op_type: "Relu"
  }
  node {
    input: "827"
    input: "824"
    output: "828"
    name: "Concat_21"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "828"
    input: "1991"
    input: "1992"
    output: "1990"
    name: "Conv_22"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1990"
    output: "831"
    name: "Relu_23"
    op_type: "Relu"
  }
  node {
    input: "820"
    output: "832"
    name: "Shape_24"
    op_type: "Shape"
  }
  node {
    output: "833"
    name: "Constant_25"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "832"
    input: "833"
    output: "834"
    name: "Gather_26"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "820"
    output: "835"
    name: "Shape_27"
    op_type: "Shape"
  }
  node {
    output: "836"
    name: "Constant_28"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "835"
    input: "836"
    output: "837"
    name: "Gather_29"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "834"
    output: "838"
    name: "Unsqueeze_30"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "837"
    output: "839"
    name: "Unsqueeze_31"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "838"
    input: "839"
    output: "840"
    name: "Concat_32"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "831"
    output: "841"
    name: "Shape_33"
    op_type: "Shape"
  }
  node {
    output: "842"
    name: "Constant_34"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "843"
    name: "Constant_35"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "844"
    name: "Constant_36"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "841"
    input: "843"
    input: "844"
    input: "842"
    output: "845"
    name: "Slice_37"
    op_type: "Slice"
  }
  node {
    input: "840"
    output: "846"
    name: "Cast_38"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "845"
    input: "846"
    output: "847"
    name: "Concat_39"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "848"
    name: "Constant_40"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "849"
    name: "Constant_41"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "831"
    input: "848"
    input: "849"
    input: "847"
    output: "850"
    name: "Resize_42"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "pytorch_half_pixel"
      type: STRING
    }
    attribute {
      name: "cubic_coeff_a"
      f: -0.75
      type: FLOAT
    }
    attribute {
      name: "mode"
      s: "linear"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
  }
  node {
    input: "850"
    input: "820"
    output: "851"
    name: "Concat_43"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "851"
    input: "1994"
    input: "1995"
    output: "1993"
    name: "Conv_44"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1993"
    output: "854"
    name: "Relu_45"
    op_type: "Relu"
  }
  node {
    input: "816"
    output: "855"
    name: "Shape_46"
    op_type: "Shape"
  }
  node {
    output: "856"
    name: "Constant_47"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "855"
    input: "856"
    output: "857"
    name: "Gather_48"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "816"
    output: "858"
    name: "Shape_49"
    op_type: "Shape"
  }
  node {
    output: "859"
    name: "Constant_50"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "858"
    input: "859"
    output: "860"
    name: "Gather_51"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "857"
    output: "861"
    name: "Unsqueeze_52"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "860"
    output: "862"
    name: "Unsqueeze_53"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "861"
    input: "862"
    output: "863"
    name: "Concat_54"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "854"
    output: "864"
    name: "Shape_55"
    op_type: "Shape"
  }
  node {
    output: "865"
    name: "Constant_56"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "866"
    name: "Constant_57"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "867"
    name: "Constant_58"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "864"
    input: "866"
    input: "867"
    input: "865"
    output: "868"
    name: "Slice_59"
    op_type: "Slice"
  }
  node {
    input: "863"
    output: "869"
    name: "Cast_60"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "868"
    input: "869"
    output: "870"
    name: "Concat_61"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "871"
    name: "Constant_62"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "872"
    name: "Constant_63"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "854"
    input: "871"
    input: "872"
    input: "870"
    output: "873"
    name: "Resize_64"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "pytorch_half_pixel"
      type: STRING
    }
    attribute {
      name: "cubic_coeff_a"
      f: -0.75
      type: FLOAT
    }
    attribute {
      name: "mode"
      s: "linear"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
  }
  node {
    input: "873"
    input: "816"
    output: "874"
    name: "Concat_65"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "874"
    input: "1997"
    input: "1998"
    output: "1996"
    name: "Conv_66"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1996"
    output: "877"
    name: "Relu_67"
    op_type: "Relu"
  }
  node {
    input: "812"
    output: "878"
    name: "Shape_68"
    op_type: "Shape"
  }
  node {
    output: "879"
    name: "Constant_69"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "878"
    input: "879"
    output: "880"
    name: "Gather_70"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "812"
    output: "881"
    name: "Shape_71"
    op_type: "Shape"
  }
  node {
    output: "882"
    name: "Constant_72"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "881"
    input: "882"
    output: "883"
    name: "Gather_73"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "880"
    output: "884"
    name: "Unsqueeze_74"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "883"
    output: "885"
    name: "Unsqueeze_75"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "884"
    input: "885"
    output: "886"
    name: "Concat_76"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "877"
    output: "887"
    name: "Shape_77"
    op_type: "Shape"
  }
  node {
    output: "888"
    name: "Constant_78"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "889"
    name: "Constant_79"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "890"
    name: "Constant_80"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "887"
    input: "889"
    input: "890"
    input: "888"
    output: "891"
    name: "Slice_81"
    op_type: "Slice"
  }
  node {
    input: "886"
    output: "892"
    name: "Cast_82"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "891"
    input: "892"
    output: "893"
    name: "Concat_83"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "894"
    name: "Constant_84"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "895"
    name: "Constant_85"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "877"
    input: "894"
    input: "895"
    input: "893"
    output: "896"
    name: "Resize_86"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "pytorch_half_pixel"
      type: STRING
    }
    attribute {
      name: "cubic_coeff_a"
      f: -0.75
      type: FLOAT
    }
    attribute {
      name: "mode"
      s: "linear"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
  }
  node {
    input: "896"
    input: "812"
    output: "897"
    name: "Concat_87"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "897"
    input: "2000"
    input: "2001"
    output: "1999"
    name: "Conv_88"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1999"
    output: "900"
    name: "Relu_89"
    op_type: "Relu"
  }
  node {
    input: "808"
    output: "901"
    name: "Shape_90"
    op_type: "Shape"
  }
  node {
    output: "902"
    name: "Constant_91"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "901"
    input: "902"
    output: "903"
    name: "Gather_92"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "808"
    output: "904"
    name: "Shape_93"
    op_type: "Shape"
  }
  node {
    output: "905"
    name: "Constant_94"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "904"
    input: "905"
    output: "906"
    name: "Gather_95"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "903"
    output: "907"
    name: "Unsqueeze_96"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "906"
    output: "908"
    name: "Unsqueeze_97"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "907"
    input: "908"
    output: "909"
    name: "Concat_98"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "900"
    output: "910"
    name: "Shape_99"
    op_type: "Shape"
  }
  node {
    output: "911"
    name: "Constant_100"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "912"
    name: "Constant_101"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "913"
    name: "Constant_102"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "910"
    input: "912"
    input: "913"
    input: "911"
    output: "914"
    name: "Slice_103"
    op_type: "Slice"
  }
  node {
    input: "909"
    output: "915"
    name: "Cast_104"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "914"
    input: "915"
    output: "916"
    name: "Concat_105"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "917"
    name: "Constant_106"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "918"
    name: "Constant_107"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "900"
    input: "917"
    input: "918"
    input: "916"
    output: "919"
    name: "Resize_108"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "pytorch_half_pixel"
      type: STRING
    }
    attribute {
      name: "cubic_coeff_a"
      f: -0.75
      type: FLOAT
    }
    attribute {
      name: "mode"
      s: "linear"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
  }
  node {
    input: "919"
    input: "808"
    output: "920"
    name: "Concat_109"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "920"
    input: "2003"
    input: "2004"
    output: "2002"
    name: "Conv_110"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "2002"
    output: "923"
    name: "Relu_111"
    op_type: "Relu"
  }
  node {
    input: "804"
    output: "924"
    name: "Shape_112"
    op_type: "Shape"
  }
  node {
    output: "925"
    name: "Constant_113"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "924"
    input: "925"
    output: "926"
    name: "Gather_114"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "804"
    output: "927"
    name: "Shape_115"
    op_type: "Shape"
  }
  node {
    output: "928"
    name: "Constant_116"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "927"
    input: "928"
    output: "929"
    name: "Gather_117"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "926"
    output: "930"
    name: "Unsqueeze_118"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "929"
    output: "931"
    name: "Unsqueeze_119"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "930"
    input: "931"
    output: "932"
    name: "Concat_120"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "923"
    output: "933"
    name: "Shape_121"
    op_type: "Shape"
  }
  node {
    output: "934"
    name: "Constant_122"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "935"
    name: "Constant_123"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "936"
    name: "Constant_124"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "933"
    input: "935"
    input: "936"
    input: "934"
    output: "937"
    name: "Slice_125"
    op_type: "Slice"
  }
  node {
    input: "932"
    output: "938"
    name: "Cast_126"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "937"
    input: "938"
    output: "939"
    name: "Concat_127"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "940"
    name: "Constant_128"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "941"
    name: "Constant_129"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "923"
    input: "940"
    input: "941"
    input: "939"
    output: "942"
    name: "Resize_130"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "pytorch_half_pixel"
      type: STRING
    }
    attribute {
      name: "cubic_coeff_a"
      f: -0.75
      type: FLOAT
    }
    attribute {
      name: "mode"
      s: "linear"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
  }
  node {
    input: "942"
    input: "804"
    output: "943"
    name: "Concat_131"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "943"
    input: "2006"
    input: "2007"
    output: "2005"
    name: "Conv_132"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "2005"
    output: "946"
    name: "Relu_133"
    op_type: "Relu"
  }
  node {
    input: "946"
    input: "801"
    output: "947"
    name: "Add_134"
    op_type: "Add"
  }
  node {
    input: "947"
    output: "948"
    name: "MaxPool_135"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "948"
    input: "2009"
    input: "2010"
    output: "2008"
    name: "Conv_136"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "2008"
    output: "951"
    name: "Relu_137"
    op_type: "Relu"
  }
  node {
    input: "951"
    input: "2012"
    input: "2013"
    output: "2011"
    name: "Conv_138"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "2011"
    output: "954"
    name: "Relu_139"
    op_type: "Relu"
  }
  node {
    input: "954"
    output: "955"
    name: "MaxPool_140"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "955"
    input: "2015"
    input: "2016"
    output: "2014"
    name: "Conv_141"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "2014"
    output: "958"
    name: "Relu_142"
    op_type: "Relu"
  }
  node {
    input: "958"
    output: "959"
    name: "MaxPool_143"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "959"
    input: "2018"
    input: "2019"
    output: "2017"
    name: "Conv_144"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "2017"
    output: "962"
    name: "Relu_145"
    op_type: "Relu"
  }
  node {
    input: "962"
    output: "963"
    name: "MaxPool_146"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "963"
    input: "2021"
    input: "2022"
    output: "2020"
    name: "Conv_147"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "2020"
    output: "966"
    name: "Relu_148"
    op_type: "Relu"
  }
  node {
    input: "966"
    output: "967"
    name: "MaxPool_149"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "967"
    input: "2024"
    input: "2025"
    output: "2023"
    name: "Conv_150"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "2023"
    output: "970"
    name: "Relu_151"
    op_type: "Relu"
  }
  node {
    input: "970"
    input: "2027"
    input: "2028"
    output: "2026"
    name: "Conv_152"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "2026"
    output: "973"
    name: "Relu_153"
    op_type: "Relu"
  }
  node {
    input: "973"
    input: "970"
    output: "974"
    name: "Concat_154"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "974"
    input: "2030"
    input: "2031"
    output: "2029"
    name: "Conv_155"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "2029"
    output: "977"
    name: "Relu_156"
    op_type: "Relu"
  }
  node {
    input: "966"
    output: "978"
    name: "Shape_157"
    op_type: "Shape"
  }
  node {
    output: "979"
    name: "Constant_158"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "978"
    input: "979"
    output: "980"
    name: "Gather_159"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "966"
    output: "981"
    name: "Shape_160"
    op_type: "Shape"
  }
  node {
    output: "982"
    name: "Constant_161"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "981"
    input: "982"
    output: "983"
    name: "Gather_162"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "980"
    output: "984"
    name: "Unsqueeze_163"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "983"
    output: "985"
    name: "Unsqueeze_164"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "984"
    input: "985"
    output: "986"
    name: "Concat_165"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "977"
    output: "987"
    name: "Shape_166"
    op_type: "Shape"
  }
  node {
    output: "988"
    name: "Constant_167"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "989"
    name: "Constant_168"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "990"
    name: "Constant_169"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "987"
    input: "989"
    input: "990"
    input: "988"
    output: "991"
    name: "Slice_170"
    op_type: "Slice"
  }
  node {
    input: "986"
    output: "992"
    name: "Cast_171"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "991"
    input: "992"
    output: "993"
    name: "Concat_172"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "994"
    name: "Constant_173"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "995"
    name: "Constant_174"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "977"
    input: "994"
    input: "995"
    input: "993"
    output: "996"
    name: "Resize_175"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "pytorch_half_pixel"
      type: STRING
    }
    attribute {
      name: "cubic_coeff_a"
      f: -0.75
      type: FLOAT
    }
    attribute {
      name: "mode"
      s: "linear"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
  }
  node {
    input: "996"
    input: "966"
    output: "997"
    name: "Concat_176"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "997"
    input: "2033"
    input: "2034"
    output: "2032"
    name: "Conv_177"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "2032"
    output: "1000"
    name: "Relu_178"
    op_type: "Relu"
  }
  node {
    input: "962"
    output: "1001"
    name: "Shape_179"
    op_type: "Shape"
  }
  node {
    output: "1002"
    name: "Constant_180"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "1001"
    input: "1002"
    output: "1003"
    name: "Gather_181"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "962"
    output: "1004"
    name: "Shape_182"
    op_type: "Shape"
  }
  node {
    output: "1005"
    name: "Constant_183"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "1004"
    input: "1005"
    output: "1006"
    name: "Gather_184"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "1003"
    output: "1007"
    name: "Unsqueeze_185"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "1006"
    output: "1008"
    name: "Unsqueeze_186"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "1007"
    input: "1008"
    output: "1009"
    name: "Concat_187"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "1000"
    output: "1010"
    name: "Shape_188"
    op_type: "Shape"
  }
  node {
    output: "1011"
    name: "Constant_189"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "1012"
    name: "Constant_190"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "1013"
    name: "Constant_191"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "1010"
    input: "1012"
    input: "1013"
    input: "1011"
    output: "1014"
    name: "Slice_192"
    op_type: "Slice"
  }
  node {
    input: "1009"
    output: "1015"
    name: "Cast_193"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "1014"
    input: "1015"
    output: "1016"
    name: "Concat_194"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "1017"
    name: "Constant_195"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "1018"
    name: "Constant_196"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1000"
    input: "1017"
    input: "1018"
    input: "1016"
    output: "1019"
    name: "Resize_197"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "pytorch_half_pixel"
      type: STRING
    }
    attribute {
      name: "cubic_coeff_a"
      f: -0.75
      type: FLOAT
    }
    attribute {
      name: "mode"
      s: "linear"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
  }
  node {
    input: "1019"
    input: "962"
    output: "1020"
    name: "Concat_198"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "1020"
    input: "2036"
    input: "2037"
    output: "2035"
    name: "Conv_199"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "2035"
    output: "1023"
    name: "Relu_200"
    op_type: "Relu"
  }
  node {
    input: "958"
    output: "1024"
